Tekla Open API Reference for Tekla Structures 2025
DrawingEnumeratorBase.MoveNext Method
 Moves to the next item in the enumerator.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool MoveNext()
Public Function MoveNext As Boolean
Return Value
Type: Boolean
True if succeeded.
Implements
IEnumerator.MoveNext()
See Also
Reference
DrawingEnumeratorBase Class
Tekla.Structures.Drawing Namespace